---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CutFailures.CannotCutGeometry
source: html/bf05759e-b578-2cfc-d3b2-3d3228a45721.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CutFailures.CannotCutGeometry Property

Elements do not intersect.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCutGeometry { get; }
```